In [2]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

import numpy as np

In [3]:
df = pd.read_csv("data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

## defcribe
-   Numeric type 데이터의 요약 정보를 보여줌

In [3]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

## unique
-   series data의 유일한 값을 list를 반환함

In [4]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [5]:
dict(enumerate(sorted(df["race"].unique())))

{0: 'black', 1: 'hispanic', 2: 'other', 3: 'white'}

In [7]:
value = list(map(int, np.array(list(enumerate(df["sex"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["sex"].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1], ['male', 'female'])

In [9]:
df["sex"].replace(to_replace=key,value=value, inplace=True)
df.head(5)

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

## sum
-    기본적인 연산 지원
-    sub, mean, min, max, count, median, mad, var 등

In [15]:
df

              earn  height  sex   race  ed  age
0     79571.299011   73.89    0  white  16   49
1     96396.988643   66.23    1  white  16   62
2     48710.666947   63.77    1  white  16   33
3     80478.096153   63.22    1  other  16   95
4     82089.345498   63.08    1  white  17   43
...            ...     ...  ...    ...  ..  ...
1374  30173.380363   71.68    0  white  12   33
1375  24853.519514   61.31    1  white  18   86
1376  13710.671312   63.64    1  white  12   37
1377  95426.014410   71.65    0  white  12   54
1378   9575.461857   68.22    0  white  12   31

[1379 rows x 6 columns]

In [13]:
df.sum(axis=0)

earn                                          44743437.5254
height                                             91831.25
sex                                                     859
race      whitewhitewhiteotherwhitewhitewhitewhitehispan...
ed                                                    18416
age                                                   62508
dtype: object

In [14]:
df.sum(axis=1)

/var/folders/vs/d7h80pg10h31n7bq9nk3bhxc0000gn/T/ipykernel_97131/1459321664.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

0       79710.189011
1       96542.218643
2       48824.436947
3       80653.316153
4       82213.425498
            ...
1374    30290.060363
1375    25019.829514
1376    13824.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

## isnull
-   column 또는 row 값의 NaN 값의 index를 반환

In [16]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [22]:
df.isnull().sum(0)

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

## sort_values
-   column 값을 기준으로 데이터를 sorting

In [25]:
df.sort_values(["age", "earn"], ascending= False).head(10)

              earn  height  sex   race  ed  age
3     80478.096153   63.22    1  other  16   95
809   42963.362005   72.94    0  white  12   95
331   39169.750135   64.79    1  white  12   95
102   39751.194030   67.14    0  white  12   93
993   32809.632677   59.61    1  other  16   92
1017   8942.806716   62.97    1  white  10   91
1192  39757.947210   64.79    0  white  16   90
952    8162.682672   58.09    1  white   5   89
827   55712.348432   70.13    0  white   9   88
939   40744.874765   59.15    1  white  15   87

### cumsum()
-   누적합
  
### cumprod()
-   누적곱

In [31]:
df.cumsum().head(5)

            earn  height  sex                       race  ed  age
0   79571.299011   73.89    0                      white  16   49
1  175968.287654  140.12    1                 whitewhite  32  111
2  224678.954602  203.89    2            whitewhitewhite  48  144
3  305157.050754  267.11    3       whitewhitewhiteother  64  239
4  387246.396253  330.19    4  whitewhitewhiteotherwhite  81  282

In [33]:
df.cumsum().head(10)

,earn,height,sex,race,ed,age
0,79571.299011,73.89,0,white,16,49
1,175968.287654,140.12,1,whitewhite,32,111
2,224678.954602,203.89,2,whitewhitewhite,48,144
3,305157.050754,267.11,3,whitewhitewhiteother,64,239
4,387246.396253,330.19,4,whitewhitewhiteotherwhite,81,282
5,402559.749154,394.72,5,whitewhitewhiteotherwhitewhite,96,312
6,449663.920975,456.26,6,whitewhitewhiteotherwhitewhitewhite,108,365
7,500623.975257,529.55,6,whitewhitewhiteotherwhitewhitewhitewhite,125,415
8,503836.624813,601.79,6,whitewhitewhiteotherwhitewhitewhitewhitehispanic,140,440
9,546833.262698,674.19,6,whitewhitewhiteotherwhitewhitewhitewhitehispan...,152,470

## Correlation & Covariance
-   상관계수와 공분산을 구하는 함수
-   corr, cov, corrwith

In [34]:
df.sort_values("age", ascending= False).head(10)

              earn  height  sex   race  ed  age
3     80478.096153   63.22    1  other  16   95
331   39169.750135   64.79    1  white  12   95
809   42963.362005   72.94    0  white  12   95
102   39751.194030   67.14    0  white  12   93
993   32809.632677   59.61    1  other  16   92
1017   8942.806716   62.97    1  white  10   91
1192  39757.947210   64.79    0  white  16   90
952    8162.682672   58.09    1  white   5   89
827   55712.348432   70.13    0  white   9   88
1068  10861.092284   64.03    1  white  13   87

In [35]:
df.age.corr(df.earn)

0.07400349177836056

In [36]:
df.age[(df.age<45) & (df.age>15)].corr(df.earn)

0.31411788725189044

In [37]:
df.age.cov(df.earn)

36523.69921040891

In [38]:
df.corr()

/var/folders/vs/d7h80pg10h31n7bq9nk3bhxc0000gn/T/ipykernel_97131/1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

            earn    height       sex        ed       age
earn    1.000000  0.291600 -0.337328  0.350374  0.074003
height  0.291600  1.000000 -0.703672  0.114047 -0.133727
sex    -0.337328 -0.703672  1.000000 -0.061747  0.070036
ed      0.350374  0.114047 -0.061747  1.000000 -0.129802
age     0.074003 -0.133727  0.070036 -0.129802  1.000000

In [39]:
df.corrwith(df.earn)

/var/folders/vs/d7h80pg10h31n7bq9nk3bhxc0000gn/T/ipykernel_97131/928202080.py:1: FutureWarning: The default value of numeric_only in DataFrame.corrwith is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corrwith(df.earn)

earn      1.000000
height    0.291600
sex      -0.337328
ed        0.350374
age       0.074003
dtype: float64

In [6]:
df.sex.value_counts(sort=True)

female    859
male      520
Name: sex, dtype: int64

In [8]:
df.sex

0         male
1       female
2       female
3       female
4       female
         ...
1374      male
1375    female
1376    female
1377      male
1378      male
Name: sex, Length: 1379, dtype: object